{"config": [{"config": {"batch_input_shape": [null, 80, 80, 3], "output_shape": null, "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>?\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "bias": true, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "bias": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "bias": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "trainable": true, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "input_dim": 576, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 576], "W_constraint": null, "output_dim": 1164, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "trainable": true, "activation": "linear", "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "input_dim": 1164, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 1164], "W_constraint": null, "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "trainable": true, "activation": "linear", "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "input_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 100], "W_constraint": null, "output_dim": 50, "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "trainable": true, "activation": "linear", "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_8", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "input_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 50], "W_constraint": null, "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "trainable": true, "activation": "linear", "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_9", "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "input_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 10], "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "name": "dense_5", "trainable": true, "activation": "tanh", "W_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}