{"keras_version": "1.2.0", "config": [{"config": {"arguments": {}, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>?\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 80, 80, 3]}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_1", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_2", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_3", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_4", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_5", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 1164, "batch_input_shape": [null, 576], "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_1", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 576, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 100, "batch_input_shape": [null, 1164], "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_2", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1164, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 100], "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_3", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 100, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 10, "batch_input_shape": [null, 50], "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_4", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 50, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 1, "batch_input_shape": [null, 10], "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "tanh", "name": "dense_5", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 10, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}